## 기본 라이브러리 임포트
from datetime import datetime
import os

## 실행 함수
def programStart():
    print(getCurrentTimeStr(), "programStart() is started...")
    ############################################################
    ## 여기에 코드를 작성하세요.
    list_item_swap()
    ############################################################
    print(getCurrentTimeStr(), "programStart() is finished...")

#########################################################################################
#########################################################################################
#########################################################################################

def list_item_swap():
    n, k = map(int, input("데이터의 갯수와 바꿔치기 가능 횟수를 입력하시오: ").split())
    a = list(map(int, input("배열 A의 모든 원소를 입력하시오: ").split()))
    b = list(map(int, input("배열 B의 모든 원소를 입력하시오: ").split()))

    a.sort() # 배열 A는 오름차순 정렬 수행
    b.sort(reverse=True)

    # 첫 번째 인덱스부터 확인하며, 두 배열의 원소를 최대 K번 비교
    for i in range(k):
        # A의 원소가 B의 원소보다 작은 경우
        if a[i] < b[i]:
            # 두 원소를 교체
            a[i], b[i] = b[i], a[i]
        else: # A의 원소가 B의 원소보다 크거나 같을 때, 반복문을 탈출
            break
    print(f"배열 A의 모든 원소의 합의 최대값: {sum(a)}")

#########################################################################################
#########################################################################################
#########################################################################################
##############################################################################
## 시간 출력을 위한 함수
def getCurrentTimeStr():
    currentTimeStr = datetime.now().strftime("%Y-%m-%d %H:%M:%S.%f")[:-3]
    return f"[{currentTimeStr}]"

##############################################################################
## 파이선 메인 함수, 파일을 실행시키면 여기부터 실행, 이 부분은 반드시 파일의 맨 마지막에 위치해야 함
if __name__ == "__main__":
    start_time = datetime.now()
    print(getCurrentTimeStr(), "main Start..")

    ##############
    ## 파이선의 메인 함수를 이용해서 실행할 함수
    programStart()
    ##############

    finish_time = datetime.now()
    print(getCurrentTimeStr(), f"main Finish..({(finish_time - start_time).total_seconds()}s Elapsed)")
